Revit 2026 API

# UIApplication Constructor

---

Use a database level Application to construct a UI-level Application.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UIApplication(
	Application revitApp
)
```
```vb
Public Sub New (
	revitApp As Application
)
```
```cpp
public:
UIApplication(
	Application^ revitApp
)
```
```fsharp
new :
        revitApp : Application -> UIApplication
```

#### Parameters

revitApp Application

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the Application argument is a null pointer. |

#### Reference

UIApplication Class

Autodesk.Revit.UI Namespace